src/Documents/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Списание</name>
  <registerRecords>AccumulationRegister.Списание</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураАрхив</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>CatalogRef.Размещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Списание</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размещение</name>
    <type>
      <types>CatalogRef.Размещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Списание/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Номенклатура") Тогда

		Объект.Номенклатура = Параметры.Номенклатура;
		
		ТЗ = НоменклатураСервер.ПолучитьОстатки(Параметры.Номенклатура);
		
		Для каждого Т Из ТЗ Цикл
			ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(), Т);
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.НоменклатураАрхив = Справочники.Номенклатура.НайтиПоНаименованию("00 Архив", Истина);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаДвиженияДокумента(Команда)

	ЗначениеОтбора = Новый Структура("Регистратор", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);

	ОткрытьФорму("РегистрНакопления.Списание.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);	
	
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);	
	
	Записать(ПараметрыЗаписи);
	
	Закрыть("Закрыт");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КомандаЗаполнитьНаСервере()

	Объект.Товары.Очистить();
	
	ТЗ = НоменклатураСервер.ПолучитьОстатки(Объект.Номенклатура);
		
	Для каждого Т Из ТЗ Цикл
		ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(), Т);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
